name: "text_encoder"
platform: "onnxruntime_onnx"
max_batch_size : 0
input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [ -1, -1 ]
  }
]
output [
  {
    name: "last_hidden_state"
    data_type: TYPE_FP16
    dims: [ -1, -1, 1024 ]
  }
]