name: "vae_encoder"
platform: "onnxruntime_onnx"
max_batch_size: 0
input [
  {
    name: "sample"
    data_type: TYPE_FP16
    dims: [ -1, -1, -1, -1 ]
  }
]
output [
  {
    name: "latent_sample"
    data_type: TYPE_FP16
    dims: [ -1, -1, -1, -1 ]
  }
]
